Revit 2027 API
BuiltInFailures.InfillFailures.InfillNoThicknessCeiling Property
 Could not change type due to highlighted infilling element. 'Basic Ceiling' infills are only compatible with 'Basic Ceiling' hosts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InfillNoThicknessCeiling { get; }
Public Shared ReadOnly Property InfillNoThicknessCeiling As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InfillNoThicknessCeiling {
	FailureDefinitionId^ get ();
}
static member InfillNoThicknessCeiling : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.InfillFailures Class
Autodesk.Revit.DB Namespace